{
  "HomePage": {
    "title": "Путеводитель по жизни в Корее",
    "description": "Комплексный информационный портал о жизни, работе и учебе в Южной Корее",
    "lifeCard": {
      "title": "Жизнь",
      "description": "Практическая информация о повседневной жизни в Корее"
    },
    "workCard": {
      "title": "Работа",
      "description": "Руководство по трудоустройству и работе в Корее"
    },
    "studyCard": {
      "title": "Учеба",
      "description": "Информация об образовании и учебе в Корее"
    },
    "libraryCard": {
      "title": "Библиотека",
      "description": "Коллекция PDF книг для изучения корейского языка"
    },
    "travelCard": {
      "title": "Путешествие",
      "description": "Полное руководство по путешествиям в Корее"
    },
    "halalCard": {
      "title": "Халяль",
      "description": "Полное руководство для мусульман в Корее"
    },
    "getStarted": "Начать",
    "getStartedDescription": "Изучите информацию о жизни, работе и учебе в Корее",
    "startChat": "Посетить библиотеку"
  },
  "Header": {
    "home": "Главная",
    "life": "Жизнь",
    "work": "Работа",
    "study": "Учеба",
    "library": "Библиотека",
    "travel": "Путешествие",
    "halal": "Халяль",
    "signIn": "Войти",
    "signOut": "Выйти"
  },
  "Footer": {
    "description": "Предоставляем комплексную информацию о жизни, работе и учебе в Корее",
    "quickLinks": "Быстрые ссылки",
    "life": "Жизнь",
    "work": "Работа",
    "study": "Учеба",
    "travel": "Путешествие",
    "halal": "Халяль",
    "resources": "Ресурсы",
    "library": "Библиотека",
    "legal": "Юридическая информация",
    "privacy": "Политика конфиденциальности",
    "terms": "Условия использования",
    "rights": "Все права защищены"
  },
  "LifePage": {
    "title": "Жизнь в Корее",
    "description": "Комплексное руководство по повседневной жизни в Корее",
    "viewMore": "Смотреть подробнее",
    "accommodation": {
      "title": "Жилье",
      "content": "В Корее есть различные варианты жилья, включая однокомнатные квартиры, офис-телы и квартиры. Системы чонсе (залог) и вольсе (ежемесячная аренда) широко используются."
    },
    "healthcare": {
      "title": "Здравоохранение",
      "content": "В Корее отличная система здравоохранения. С Национальным медицинским страхованием вы можете получить доступ к медицинским услугам по доступным ценам."
    },
    "transportation": {
      "title": "Транспорт",
      "content": "В Корее эффективная система общественного транспорта. Вы можете использовать метро, автобусы, такси и многое другое с удобной картой T-money."
    },
    "culture": {
      "title": "Культура",
      "content": "Корейская культура уникальна, сочетая традиции и современность. Уважение, вежливость и коллективизм являются важными ценностями."
    },
    "banking": {
      "title": "Банковское дело",
      "content": "В Корее есть различные банки. Дебетовые карты, кредитные карты и интернет-банкинг широко используются. Иностранцы также могут открыть банковский счет, требуется удостоверение личности."
    },
    "shopping": {
      "title": "Шоппинг",
      "content": "Корея - это рай для шоппинга. Есть различные торговые районы, такие как Мёндон, Хондэ и Итхэвон, а онлайн-торговые центры также очень развиты. Есть много магазинов беспошлинной торговли, популярных среди иностранных туристов."
    },
    "food": {
      "title": "Еда",
      "content": "Корейская еда здоровая и вкусная. Кимчи, пулькоги и пибимпап известны, и есть различные рестораны и закусочные. Службы доставки также очень развиты и удобны."
    },
    "language": {
      "title": "Язык",
      "content": "Корейский язык необходим для жизни в Корее. Улучшение навыков корейского языка значительно облегчит повседневную жизнь. Есть различные корейские языковые академии и онлайн-курсы, и вы можете подготовиться к тесту TOPIK."
    }
  },
  "WorkPage": {
    "title": "Работа в Корее",
    "description": "Комплексное руководство по трудоустройству и работе в Корее",
    "viewMore": "Смотреть подробнее",
    "visa": {
      "title": "Виза",
      "content": "Для работы в Корее вам нужна соответствующая рабочая виза. Различные типы виз включают E-9, E-7, F-2 и т.д."
    },
    "jobSearch": {
      "title": "Поиск работы",
      "content": "Корейский рынок труда является конкурентным. Вы можете найти возможности через онлайн-сайты по поиску работы, программы стажировки и нетворкинг."
    },
    "workCulture": {
      "title": "Корпоративная культура",
      "content": "Корейская корпоративная культура иерархична и вертикальна. Уважение и сотрудничество важны, а корпоративные ужины (хвесик) являются обычным явлением."
    },
    "salary": {
      "title": "Зарплата",
      "content": "Средняя зарплата в Корее варьируется в зависимости от отрасли и типа работы. IT, финансы и обрабатывающая промышленность предлагают высокие зарплаты, а годовые системы зарплат распространены. Существует также система бонусов, поэтому вы можете получать дополнительный доход в конце года."
    },
    "workingHours": {
      "title": "Рабочие часы",
      "content": "Типичные рабочие часы в Корее составляют 40 часов в неделю. Однако многие компании имеют сверхурочную работу, и гибкие системы работы постепенно распространяются. Пятидневная рабочая неделя является стандартом."
    },
    "taxes": {
      "title": "Налоги",
      "content": "Подоходный налог взимается с дохода от работы в Корее. Вы должны платить подоходный налог и местный налог, и можете получить возмещение через годовой налоговый расчет."
    },
    "resume": {
      "title": "Резюме",
      "content": "Корейские резюме имеют специальный формат. Требуется фотография, и вы должны подробно описать свое образование, карьеру и квалификацию. Сопроводительное письмо также является важным элементом."
    },
    "interview": {
      "title": "Собеседование",
      "content": "Корейские собеседования обычно проходят в несколько этапов. Есть первичный отбор документов, второе собеседование, финальное собеседование и т.д. Ношение формальной одежды является обычным явлением, и поддержание вежливости важно."
    }
  },
  "StudyPage": {
    "title": "Учеба в Корее",
    "description": "Комплексное руководство по образованию и учебе в Корее",
    "viewMore": "Смотреть подробнее",
    "universities": {
      "title": "Университеты",
      "content": "В Корее много отличных университетов. Сеульский национальный университет, Университет Йонсей и Корейский университет хорошо известны."
    },
    "scholarships": {
      "title": "Стипендии",
      "content": "Корейское правительство и университеты предлагают различные программы стипендий. Есть стипендии на основе заслуг и стипендии для иностранных студентов."
    },
    "admission": {
      "title": "Поступление",
      "content": "Поступление в корейские университеты является очень конкурентным. Важны знание корейского языка, академическая успеваемость и рекомендательные письма."
    },
    "languageRequirements": {
      "title": "Языковые требования",
      "content": "Большинство корейских университетов требуют знание корейского языка. Требуются баллы теста TOPIK, и некоторые университеты также предлагают программы на английском языке. Вы можете подготовиться в корейских языковых академиях."
    },
    "costs": {
      "title": "Расходы",
      "content": "Стоимость обучения в корейских университетах варьируется в зависимости от университета. Государственные университеты относительно дешевы, а частные университеты более дорогие. Необходимо учитывать расходы на проживание, проживание и учебники."
    },
    "studentLife": {
      "title": "Студенческая жизнь",
      "content": "Студенческая жизнь в Корее яркая с различными мероприятиями. Вы можете наслаждаться клубами, фестивалями и программами обмена студентами."
    },
    "partTimeWork": {
      "title": "Подработка",
      "content": "Иностранные студенты также могут работать неполный рабочий день в рамках, разрешенных их визой. Вы можете работать в кафе, магазинах, ресторанах и т.д., и гарантирована минимальная почасовая оплата."
    },
    "afterGraduation": {
      "title": "После окончания",
      "content": "После окончания корейского университета вы можете перейти на рабочую визу или вернуться в свою страну. Если вы хотите работать в Корее, важны знание корейского языка и профессиональные знания."
    }
  },
  "TravelPage": {
    "title": "Путешествие по Корее",
    "description": "Полное руководство по путешествиям и туризму в Корее",
    "viewMore": "Смотреть подробнее",
    "popularDestinations": {
      "title": "Популярные направления",
      "content": "Корея предлагает множество удивительных направлений. Сеул, Пусан, остров Чеджу и Кёнджу - обязательные места для посещения туристами."
    },
    "touristTransportation": {
      "title": "Транспорт для туристов",
      "content": "Передвижение по Корее легко благодаря отличному общественному транспорту. Метро, автобусы и поезда соединяют все основные туристические направления."
    },
    "hotelsAccommodation": {
      "title": "Отели и размещение",
      "content": "Корея предлагает различные варианты размещения для туристов, от роскошных отелей до традиционных ханоков и бюджетных гостевых домов."
    },
    "foodRestaurants": {
      "title": "Еда и рестораны",
      "content": "Корейская кухня - это изюминка любой поездки. От уличной еды до изысканных ресторанов, есть бесчисленное множество ресторанов и гастрономических впечатлений для открытия."
    },
    "cultureTraditions": {
      "title": "Культура и традиции",
      "content": "Познакомьтесь с богатой культурой Кореи через традиционные представления, храмы, дворцы и культурные фестивали в течение всего года."
    },
    "tripPlanning": {
      "title": "Планирование поездки",
      "content": "Спланируйте идеальную поездку в Корею с советами о лучшем времени для посещения, предложениями маршрутов и важной туристической информацией."
    },
    "seasonsWeather": {
      "title": "Сезоны и погода",
      "content": "В Корее четыре четко выраженных сезона. Весна и осень идеальны для путешествий, с цветением сакуры весной и красочной листвой осенью."
    },
    "travelBudget": {
      "title": "Бюджет путешествия",
      "content": "Корею можно путешествовать с разным бюджетом. Узнайте о расходах на размещение, еду, транспорт и развлечения, чтобы спланировать свои расходы."
    },
    "touristSafety": {
      "title": "Безопасность туристов",
      "content": "Корея - одна из самых безопасных стран в мире. Узнайте о советах по безопасности, контактах экстренных служб и о том, как оставаться в безопасности во время путешествий."
    },
    "attractions": {
      "title": "Достопримечательности",
      "content": "Откройте для себя главные достопримечательности Кореи, включая дворцы, храмы, музеи, тематические парки и природные чудеса, демонстрирующие красоту страны."
    }
  },
  "HalalPage": {
    "title": "Халяль в Корее",
    "description": "Полное руководство для мусульман, живущих в Корее или посещающих её",
    "viewMore": "Смотреть подробнее",
    "halalRestaurants": {
      "title": "Халяльные рестораны",
      "content": "Найдите сертифицированные халяльные рестораны и мусульманские заведения общественного питания по всей Корее. Многие рестораны в Итхэвоне, Сеуле и других крупных городах предлагают халяльную еду."
    },
    "mosques": {
      "title": "Мечети",
      "content": "Откройте для себя мечети и исламские молитвенные помещения в Корее. Центральная мечеть Сеула в Итхэвоне является крупнейшей, с несколькими другими мечетями в крупных городах."
    },
    "halalFood": {
      "title": "Халяльная еда",
      "content": "Узнайте о вариантах халяльной еды, сертификации халяль и где найти халяльные ингредиенты и продукты в корейских супермаркетах и магазинах."
    },
    "islamicCommunity": {
      "title": "Исламское сообщество",
      "content": "Свяжитесь с мусульманским сообществом в Корее. Найдите информацию об исламских центрах, общественных мероприятиях и сетях поддержки для мусульман."
    },
    "prayerFacilities": {
      "title": "Молитвенные помещения",
      "content": "Найдите молитвенные комнаты и помещения в аэропортах, торговых центрах, университетах и общественных местах по всей Корее для ежедневных молитв."
    },
    "halalShopping": {
      "title": "Халяльный шоппинг",
      "content": "Найдите сертифицированные халяльные продукты, исламскую одежду, молитвенные принадлежности и другие мусульманские товары в торговых районах Кореи и интернет-магазинах."
    },
    "islamicEvents": {
      "title": "Исламские события",
      "content": "Будьте в курсе исламских праздников, общественных собраний, религиозных мероприятий и культурных празднований, организованных мусульманским сообществом в Корее."
    },
    "muslimFriendlyServices": {
      "title": "Услуги для мусульман",
      "content": "Откройте для себя мусульманские отели, туристические услуги, медицинские учреждения и другие услуги, которые учитывают исламские требования и предпочтения."
    }
  },
  "PrivacyPage": {
    "title": "Политика конфиденциальности",
    "lastUpdated": "Последнее обновление: 2024",
    "section1": {
      "title": "Сбор информации",
      "content": "Мы собираем только минимальную информацию, необходимую для предоставления наших услуг. Мы можем собирать ваш адрес электронной почты и имя через вход в Google."
    },
    "section2": {
      "title": "Использование информации",
      "content": "Собранная информация используется исключительно для предоставления услуг, улучшения и поддержки клиентов."
    },
    "section3": {
      "title": "Защита информации",
      "content": "Мы применяем соответствующие технические и административные меры безопасности для защиты вашей личной информации."
    },
    "section4": {
      "title": "Куки",
      "content": "Мы используем необходимые куки для функциональности сервиса. Вы можете управлять куками через настройки браузера."
    },
    "section5": {
      "title": "Контакты",
      "content": "Если у вас есть вопросы о нашей политике конфиденциальности, пожалуйста, свяжитесь с нами."
    }
  },
  "TermsPage": {
    "title": "Условия использования",
    "lastUpdated": "Последнее обновление: 2024",
    "section1": {
      "title": "Использование сервиса",
      "content": "Этот сервис предоставляет информацию о жизни, работе и учебе в Корее. Используя сервис, вы соглашаетесь с этими условиями."
    },
    "section2": {
      "title": "Ответственность пользователя",
      "content": "Пользователи несут ответственность за надлежащее и законное использование сервиса."
    },
    "section3": {
      "title": "Интеллектуальная собственность",
      "content": "Весь контент на этом веб-сайте защищен авторским правом. Несанкционированное использование запрещено."
    },
    "section4": {
      "title": "Изменения сервиса",
      "content": "Мы можем изменять или прекращать работу сервиса без предварительного уведомления."
    },
    "section5": {
      "title": "Отказ от ответственности",
      "content": "Мы не гарантируем точность или полноту информации, предоставляемой через сервис."
    }
  },
  "SignInPage": {
    "title": "Вход",
    "description": "Войдите с помощью аккаунта Google, чтобы использовать сервис",
    "signInWithGoogle": "Войти через Google",
    "signingIn": "Вход...",
    "terms": "Войдя в систему, вы соглашаетесь с нашими Условиями использования и Политикой конфиденциальности."
  },
  "LibraryPage": {
    "title": "Библиотека",
    "description": "Коллекция PDF книг для изучения корейского языка",
    "loading": "Загрузка...",
    "noBooks": "Книги пока недоступны",
    "download": "Скачать",
    "view": "Просмотр",
    "categories": {
      "all": "Все",
      "vocabulary": "Словарь",
      "grammar": "Грамматика",
      "topik": "ТОПИК",
      "writing": "Письмо"
    }
  }
}

